<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="1,3,864,864" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="image"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_6845" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6845"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Subtract_6846" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Subtract_6846"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_20349" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="12" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Divide_6848" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6847, Divide_6848"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1289" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="24" size="3456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1289"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1289">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Convolution_389" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_389"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>864</dim>
					<dim>864</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_409" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3480" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1288" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1288, Concat_408, Reshape_409"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1288">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="359" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="359, Maximum_437"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="359">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="1292" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="3608" size="4096"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1292"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1292">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Convolution_439" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_439"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_459" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="7704" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="1291" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1291, Concat_458, Reshape_459"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1291">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="364" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="364, Maximum_487"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="364">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Reshape_496" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="7832" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="GroupConvolution_562" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_562, Reshape_496"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_582" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="8984" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="1294" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1294, Concat_581, Reshape_582"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1294">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="369" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="369, Maximum_610"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="369">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="1298" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="9112" size="2048"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1298"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1298">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convolution_612" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_612"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_632" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="11160" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="1297" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1297, Concat_631, Reshape_632"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1297">
					<dim>1</dim>
					<dim>16</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="1301" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="11224" size="6144"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1301"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1301">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Convolution_660" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_660"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_680" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="17368" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="1300" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1300, Concat_679, Reshape_680"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1300">
					<dim>1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="376" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="376, Maximum_708"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="376">
					<dim>1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_717" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="17752" size="3456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="GroupConvolution_783" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_783, Reshape_717"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>432</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_803" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="21208" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="1303" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1303, Concat_802, Reshape_803"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1303">
					<dim>1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="381" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="381, Maximum_831"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="381">
					<dim>1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="1307" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="21592" size="9216"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1307"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1307">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Convolution_833" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_833"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_853" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="30808" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="1306" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1306, Concat_852, Reshape_853"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1306">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="1310" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="30904" size="13824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1310"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1310">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Convolution_881" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_881"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_901" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="44728" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="1309" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1309, Concat_900, Reshape_901"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1309">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="388" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="388, Maximum_929"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="388">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_938" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="45304" size="5184"/>
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="GroupConvolution_1004" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1004, Reshape_938"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_1024" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="50488" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="1312" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1312, Concat_1023, Reshape_1024"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1312">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="393" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="393, Maximum_1052"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="393">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="1316" type="Const" version="opset1">
			<data element_type="f32" shape="24, 144, 1, 1" offset="51064" size="13824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1316"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1316">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Convolution_1054" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1054"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_1074" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="64888" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="1315" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1315, Concat_1073, Reshape_1074"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1315">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="396" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="396"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="396">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="1319" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="64984" size="13824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1319"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1319">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Convolution_1103" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1103"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_1123" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="78808" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="1318" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1318, Concat_1122, Reshape_1123"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1318">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="401" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="401, Maximum_1151"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="401">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_1160" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="79384" size="5184"/>
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="GroupConvolution_1226" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1226, Reshape_1160"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>216</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_1246" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="84568" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="1321" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1321, Concat_1245, Reshape_1246"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1321">
					<dim>1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="406" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="406, Maximum_1274"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="406">
					<dim>1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="1325" type="Const" version="opset1">
			<data element_type="f32" shape="32, 144, 1, 1" offset="85144" size="18432"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1325"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1325">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Convolution_1276" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1276"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_1296" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="103576" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="1324" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1324, Concat_1295, Reshape_1296"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1324">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="1328" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="103704" size="24576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1328"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1328">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Convolution_1324" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1324"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Reshape_1344" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="128280" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="1327" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1327, Concat_1343, Reshape_1344"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1327">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="413" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="413, Maximum_1372"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="413">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_1381" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="129048" size="6912"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="GroupConvolution_1447" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1447, Reshape_1381"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_1467" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="135960" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="1330" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1330, Concat_1466, Reshape_1467"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1330">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="418" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="418, Maximum_1495"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="418">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="1334" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="136728" size="24576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1334"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1334">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Convolution_1497" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1497"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Reshape_1517" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="161304" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="1333" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1333, Concat_1516, Reshape_1517"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1333">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="421" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="421"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="421">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="1337" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="161432" size="24576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1337"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1337">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Convolution_1546" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1546"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Reshape_1566" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="186008" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="1336" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1336, Concat_1565, Reshape_1566"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1336">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="426" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="426, Maximum_1594"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="426">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_1603" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="186776" size="6912"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="GroupConvolution_1669" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1669, Reshape_1603"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_1689" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="193688" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="1339" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1339, Concat_1688, Reshape_1689"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1339">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="431" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="431, Maximum_1717"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="431">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="1343" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="194456" size="24576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1343"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1343">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Convolution_1719" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1719"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_1739" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="219032" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="1342" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1342, Concat_1738, Reshape_1739"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1342">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="434" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="434"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="434">
					<dim>1</dim>
					<dim>32</dim>
					<dim>108</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="1346" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="219160" size="24576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1346"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1346">
