<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Gather_127193" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Subtract_13723" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Subtract_13723"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Gather_127196" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="12" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Divide_13725" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_13724, Divide_13725"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="2182" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="2182"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="2182"/>
			</output>
		</layer>
		<layer id="6" name="792" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="789, 792"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="789,792">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="793" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="793"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="793"/>
			</output>
		</layer>
		<layer id="8" name="Constant_365" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_365"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="9" name="794" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="793, 794, Constant_365"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="794"/>
			</output>
		</layer>
		<layer id="10" name="812" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="2182, 812"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="812"/>
			</output>
		</layer>
		<layer id="11" name="813" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="813"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="813"/>
			</output>
		</layer>
		<layer id="12" name="814" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="813, 814, 815, 816"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="814,815,816"/>
			</output>
		</layer>
		<layer id="13" name="Constant_396" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_396"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="836" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="836, Constant_396"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="836">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="817" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="817"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="817"/>
			</output>
		</layer>
		<layer id="16" name="818" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="817, 818, 819, 820"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="818,819,820"/>
			</output>
		</layer>
		<layer id="17" name="821" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="821"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="821"/>
			</output>
		</layer>
		<layer id="18" name="Constant_398" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_398"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="837" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="837, Constant_398"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="837">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="2178" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="2178"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="2178"/>
			</output>
		</layer>
		<layer id="21" name="790" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="790"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="790"/>
			</output>
		</layer>
		<layer id="22" name="Constant_361" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_361"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="23" name="791" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="790, 791, Constant_361"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="791"/>
			</output>
		</layer>
		<layer id="24" name="803" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="2178, 803"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="803"/>
			</output>
		</layer>
		<layer id="25" name="822" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="822"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="822"/>
			</output>
		</layer>
		<layer id="26" name="823" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="822, 823, 824, 825"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="823,824,825"/>
			</output>
		</layer>
		<layer id="27" name="Constant_400" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_400"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="838" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="838, Constant_400"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="838">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="826" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="826"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="826"/>
			</output>
		</layer>
		<layer id="30" name="827" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="826, 827, 828, 829"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="827,828,829"/>
			</output>
		</layer>
		<layer id="31" name="830" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="830"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="830"/>
			</output>
		</layer>
		<layer id="32" name="Constant_402" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_402"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="839" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="839, Constant_402"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="839">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="840" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="840, 848"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="840,848">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="849" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="56" size="32"/>
			<output>
				<port id="0" precision="I64" names="849">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="850" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="842, 843, 847, 849, 850"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="850">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="851" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="88" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="851"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="851">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="852" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="851, 852"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="852">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="854" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="853, 854, 855, 856, 857"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="854">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="855" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="853, 854, 855, 856, 857"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="855">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="856" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="853, 854, 855, 856, 857"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="856">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="857" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="853, 854, 855, 856, 857"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="857">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_447" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="120" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_447"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="858" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="858, Constant_447"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="858">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="859" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="859"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="859">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="860" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="859, 860, 861"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="860,861">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_458" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_458"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="48" name="Split_459" type="Split" version="opset1">
			<data num_splits="2"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_458, Split_459"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="862" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="136" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="862"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="862"/>
			</output>
		</layer>
		<layer id="50" name="863" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="863"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="863">
					<dim>1</dim>
					<dim>3</dim>
					<dim>225</dim>
					<dim>225</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Gather_127199" type="Const" version="opset1">
			<data element_type="f32" shape="24, 3, 3, 3" offset="140" size="2592"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Convolution_835" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_835"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>225</dim>
					<dim>225</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Reshape_855" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="2732" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="1841" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1841, Concat_854, Reshape_855"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1841">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="867" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="866, 867"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="867">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="1845" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 3, 3" offset="2828" size="20736"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1845"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1845">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Convolution_885" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_885"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_905" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="23564" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="1844" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1844, Concat_904, Reshape_905"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1844">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="871" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="870, 871"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="871">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="872" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="872"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="872">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="1848" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 3, 3" offset="23660" size="20736"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1848"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1848">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Convolution_936" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_936"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_956" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="44396" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="1847" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1847, Concat_955, Reshape_956"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1847">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="876" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="875, 876"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="876">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="877" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="877"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="877">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="2195" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="44492" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="2195"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="2195"/>
			</output>
		</layer>
		<layer id="69" name="887" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="884, 887"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="884,887">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="888" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="32" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="888"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="888"/>
			</output>
		</layer>
		<layer id="71" name="Constant_993" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_993"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="72" name="889" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="888, 889, Constant_993"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="889"/>
			</output>
		</layer>
		<layer id="73" name="907" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="2195, 907"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="907"/>
			</output>
		</layer>
		<layer id="74" name="908" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="908"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="908"/>
			</output>
		</layer>
		<layer id="75" name="909" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="908, 909, 910, 911"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="909,910,911"/>
			</output>
		</layer>
		<layer id="76" name="Constant_1024" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1024"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="931" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="931, Constant_1024"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="931">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="912" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="912"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="912"/>
			</output>
		</layer>
		<layer id="79" name="913" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="912, 913, 914, 915"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="913,914,915"/>
			</output>
		</layer>
		<layer id="80" name="916" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="916"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="916"/>
			</output>
		</layer>
		<layer id="81" name="Constant_1026" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1026"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="932" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="932, Constant_1026"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="932">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="2191" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="44492" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="2191"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="2191"/>
			</output>
		</layer>
		<layer id="84" name="885" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="885"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="885"/>
			</output>
		</layer>
		<layer id="85" name="Constant_989" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_989"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="86" name="886" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="885, 886, Constant_989"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="886"/>
			</output>
		</layer>
		<layer id="87" name="898" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="2191, 898"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="898"/>
			</output>
		</layer>
		<layer id="88" name="917" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="917"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="917"/>
			</output>
		</layer>
		<layer id="89" name="918" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="917, 918, 919, 920"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="918,919,920"/>
			</output>
		</layer>
		<layer id="90" name="Constant_1028" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1028"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="933" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="933, Constant_1028"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="933">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="921" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="48" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="921"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="921"/>
			</output>
		</layer>
		<layer id="93" name="922" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="921, 922, 923, 924"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="922,923,924"/>
			</output>
		</layer>
		<layer id="94" name="925" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="925"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="925"/>
			</output>
		</layer>
		<layer id="95" name="Constant_1030" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1030"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="934" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="934, Constant_1030"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="934">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="935" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="935, 943"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="935,943">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="944" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="56" size="32"/>
			<output>
				<port id="0" precision="I64" names="944">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="945" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="937, 938, 942, 944, 945"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="945">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="946" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="88" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="946"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="946">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="947" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="946, 947"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="947">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="949" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="948, 949, 950, 951, 952"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="949">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="950" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="112" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="948, 949, 950, 951, 952"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="950">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="951" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="948, 949, 950, 951, 952"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="951">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="952" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="948, 949, 950, 951, 952"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="952">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_1075" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="120" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1075"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="953" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="953, Constant_1075"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="953">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="954" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="954"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="954">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="955" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="954, 955, 956"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="955,956">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_1086" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1086"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="111" name="Split_1087" type="Split" version="opset1">
			<data num_splits="2"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1086, Split_1087"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="957" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="136" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="957"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="957"/>
			</output>
		</layer>
		<layer id="113" name="958" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="958"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="958">
					<dim>1</dim>
					<dim>24</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="1851" type="Const" version="opset1">
			<data element_type="f32" shape="96, 24, 3, 3" offset="44500" size="82944"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1851"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1851">
					<dim>96</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Convolution_1463" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1463"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>113</dim>
					<dim>113</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Reshape_1483" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="127444" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="1850" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1850, Concat_1482, Reshape_1483"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1850">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="962" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="961, 962"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="962">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="1854" type="Const" version="opset1">
			<data element_type="f32" shape="48, 96, 1, 1" offset="127828" size="18432"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1854"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="1854">
					<dim>48</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Convolution_1513" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1513"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Reshape_1533" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="146260" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="1853" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1853, Concat_1532, Reshape_1533"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1853">
